backgroundMesh/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{

#includeEtc "caseDicts/setConstraintTypes"

    outerSides
    {
        type            overset;
    }

    hole
    {
        type            zeroGradient;
    }

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
       type            fixedValue;
        value           uniform 0;
    }

    topAndBottom
    {
        type            symmetry;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
