backgroundMesh/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

motionSolverLibs (sixDoFRigidBodyMotion);

motionSolver    sixDoFRigidBodyMotion;


displacementLaplacianCoeffs
{
    diffusivity     uniform 1;
}

dynamicFvMesh       dynamicOversetFvMesh;

dynamicOversetFvMeshCoeffs
{
//    layerRelax 0.3;
}

sixDoFRigidBodyMotionCoeffs
{

    accelerationRelaxation 1.0;
    accelerationDamping 1.0;

    patches         (hole);
    innerDistance   1;
    outerDistance   1.1;

    mass           0.007854;
   centreOfMass    (0 0 0);
   centreOfRotation (0 0 0);
   momentOfInertia (3.93E-9 3.93E-9 3.93E-9);

   g               (0 0 0);
   rho             rhoInf;
   rhoInf          10000;
   report          on;

   solver
   {
      type    symplectic;
   }

   constraints
   {

    yLine
    {
       sixDoFRigidBodyMotionConstraint   line;
       direction                     (0 1 0);
    }


    zAxis
    {
        sixDoFRigidBodyMotionConstraint orientation;
        centreOfRotation                (0 0 0);
    }
}


restraints
{
    verticalSpring
    {
        sixDoFRigidBodyMotionRestraint linearSpring;

        anchor          (0.0 0.0 0.0);
        refAttachmentPt (0 0 0);
        stiffness       33.644;
        damping         0.00;
        restLength      0.0;
    }


}

}

// ************************************************************************* //
