backgroundMesh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("liboverset.so");

application     overPimpleDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          0.00025;

writeControl    runTime;

writeInterval   0.005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;

adjustTimeStep yes;

maxCo   0.5;


functions
{

forceCoeffs_object
    {
	
	type forceCoeffs;
	libs ("libforces.so");
	
	patches ("hole");

	pName p;
	Uname U;
	rho rhoInf;
	rhoInf 1.0;

    CofR (0 0 0);
	liftDir (0 1 0);
	dragDir (1 0 0);
	magUInf 0.05;
	lRef 0.0001;         
	Aref 0.0001;	

        writeControl   timeStep;
        writeInterval  1;

    }


}
// ************************************************************************* //
