backgroundMesh/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

   cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;

        tolerance       1e-06;
        relTol          0;

	minIter		3;
    }

    p
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.0;

	minIter		3;
    }

    pFinal
    {
        $p;
        relTol          0;

	minIter		3;
    }

    pcorr
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;

	minIter		3;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;

	minIter		3;
    }

    U
    {

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;

        relTol          0.0;
	minIter		3;
    }

    UFinal
    {
        $U;
        tolerance       1e-08;
        relTol          0.0;

	minIter		3;
    }

      Phi
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance 1e-7;
        relTol          0;
    };


}

PIMPLE
{
    momentumPredictor   true;			

    oversetAdjustPhi    true;		

    nOuterCorrectors    	10;
    nCorrectors         	1;
    nNonOrthogonalCorrectors 	0;
	

}

relaxationFactors
{
    fields
    {
       ".*"           1.0;
    }
    equations
    {
        ".*"           1.0;
    }
}

// ************************************************************************* //
